Revit 2027 API
Transform.HasReflection Property
The boolean value that indicates whether this transformation produces reflection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasReflection { get; }
Public ReadOnly Property HasReflection As Boolean
	Get
public:
property bool HasReflection {
	bool get ();
}
member HasReflection : bool with get
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when this transformation is not conformal and the reflection is undefined.
Remarks
 Reflection transformation changes the handedness of a coordinate system.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace